المقارنة بين أنواع القوائم المرتبطة (Linked Lists):
القائمة المرتبطة الأحادية (Singly)
الاستخدامات : تنفيذ الجداول الهاش (Hash Tables)، القوائم البسيطة. 

المميزات(Pros) : استهلاك أقل للذاكرة، سهولة في الإدراج والحذف من البداية.

العيوب(Cons) : التنقل في اتجاه واحد فقط، لا يمكن الرجوع للخلف.

القائمة المرتبطة الدائرية (Circular): 
الاستخدامات:. أنظمة التشغيل (جدولة العمليات)، تشغيل قوائم الأغاني (Playlist).

المميزات: . إمكانية الوصول لأي عقدة من أي نقطة، لا يوجد نهاية (Null).

العيوب: . قد تدخل في حلقة لا نهائية إذا لم يتم التعامل معها بحذر.

القائمة المرتبطة المزدوجة (Doubly):
الاستخدامات: متصفحات الويب (للأمام والخلف)، برامج التحرير (Undo/Redo).

المميزات : إمكانية التنقل في الاتجاهين، الحذف أسهل إذا كان معك مؤشر العقدة.

العيوب: تستهلك ذاكرة أكبر (بسبب مؤشر "السابق" prev).
